"""Імітація тексту

Прочитайте файл, вказаний в командній стрічці.
Використовуйте str.split() (без аргументів) для отримання всіх слів в файлі.
Замість того, щоб читати файл пострічково, простіше зчитати
його в одну велику стрічку і застосувати до неї split() один раз.

Створіть "імітаційний" словник, який зв’язує кожне слово
зі списком всіх слів, які безпосередньо слідують за цим словом в файлі.
Список слів може бути в довільному порядку і повинен включати дублікати. 

Так, наприклад, для тексту "Привіт, світ! Привіт, Всесвіт!" ми отримаємо такий
імітаційний словник:
{'': ['Привіт,'], 'Привіт,': ['світ!', 'Всесвіт!'], 'світ!': ['Привіт,']}
Будемо вважати, в якості ключа для першого слова в файлі використовується пуста
стрічка.

За допомогою імітаційного словника доволі просто генерувати випадкові тексти, 
які імітують оригінальний. Візьміть слово, перегляньте які слова можуть бути за ним, 
виберіть одне з них наугад, виведіть його і використовуйте це слово 
в наступній ітерації.

Використовуйте пусту стрічку в якості ключа для першого слова.
Якщо ви коли-небудь застрягнете на слові, якого немає в словнику,
повернітьсь до пустої стрічки, щоб продовжити генерацію тексту.

Стандартний python-модуль random включає в себе метод 
random.choice(list), який вибирає випадковий елемент із непустого списку.

"""

import sys
import os
import random

def mimic_dict(filename):
    """Повертає імітаційний словник, який співставляє кожне слово 
    зі списком слів, які безпосередньо слідують за ним в тексті"""
    
    q = 0
    for i in list(os.walk(r'/home/ogion/words/pages/25-38/')):
        q += 1
        file = open(i, 'r')
        text = ''.join(file.readlines()).replace('\n', ' ').replace('\t', ' ').split(' ')
        if q == 250:
            break
        else:
            for i in text:
                if i == '':
                    text.pop(text.index(i))
            
            mimic_dictionary = {'':[text[0]]}

            for i in range(len(text) - 1):
                prom = text[i + 1]
                
                if text[i] in mimic_dictionary:
                    mimic_dictionary[text[i]].append(prom)
                else:
                    mimic_dictionary[text[i]] = [prom]

    return(mimic_dictionary)


def print_mimic(mimic_dict, word):
    """Приймає в якості аргументів імітаційний словник і початкове слово,
    виводить 200 випадкових слів, згідно правил імітації."""
    print_word = word
    for i in range(1, 200):
        try:
            print_word = random.choice(mimic_dict[print_word])
            
            print(print_word, end = ' ')
        
        except KeyError:
            print('\nПрограма досягла останнього слова в словнику\n')
    print()
    return

def main():
    # if len(sys.argv) != 2:
    #     print('usage: ./mimic.py file-to-read')
    #     sys.exit(1)

    d = mimic_dict(sys.argv[1])
    print_mimic(d, '')

if __name__ == '__main__':
    main()
