import math
from functools import reduce

# Заповнити код приведених нижче функцій. Функція main() вже
# налаштована для виклику функцій з декількома різними
# параметрами, і виводить 'OK' у випадку, якщо виклик функції
# коректний.
# Початковий код кожної функції містить 'return'
# і є просто заготовкою для вашого коду.



# A. Різниця між сумою квадратів і квадратом суми
# Сума квадратів перших десяти натуральних чисел
# 1**2 + 2**2 + ... + 10**2 = 385
# Квадрат суми перших десяти натуральних чисел
# (1 + 2 + ... + 10)**2 = 55**2 = 3025
# Значить, різниця між сумою квадратів і квадратом суми перших
# десяти натуральних чисел складає 3025 - 385 = 2640.
# Знайдіть різницю між сумою квадратів і квадратом суми перших 
# сто натуральних чисел.
# Вирішіть задачу двома способами: за допомогою map і lambda 
# і за допомогою генератора списку. 

def diff():
    a = sum(map(lambda x: x, range(101))) ** 2
    b = sum(map(lambda x: x ** 2, range(101)))
    return a - b

def diff_gen():
    a = sum([i for i in range(101)]) ** 2
    b = sum([i ** 2 for i in range(101)])
    return a - b

# B. Найбільший добуток п’яти послідовних цифр
# Знайдіть найбільший добуток п’яти послідовних цифр в 
# 1000-значному числі.
a = """
73167176531330624919225119674426574742355349194934
96983520312774506326239578318016984801869478851843
85861560789112949495459501737958331952853208805511
12540698747158523863050715693290963295227443043557
66896648950445244523161731856403098711121722383113
62229893423380308135336276614282806444486645238749
30358907296290491560440772390713810515859307960866
70172427121883998797908792274921901699720888093776
65727333001053367881220235421809751254540594752243
52584907711670556013604839586446706324415722155397
53697817977846174064955149290862569321978468622482
83972241375657056057490261407972968652414535100474
82166370484403199890008895243450658541227588666881
16427171479924442928230863465674813919123162824586
17866458359124566529476545682848912883142607690042
24219022671055626321111109370544217506941658960408
07198403850962455444362981230987879927244284909188
84580156166097919133875499200524063689912560717606
05886116467109405077541002256983155200055935729725
71636269561882670428252483600823257530420752963450"""

def max_five():
    _max = 0
    b = list(map(int, a.replace('\n', '')))
    for i in range(len(b) - 4):
        prom = b[i]
        for j in range(1, 5):
            prom *= b[i + j]
        if prom > _max:
            _max = prom
    return _max


# C. Сума цифр числа 2**1000
# 2**15 = 32768, сума цифр 3 + 2 + 7 + 6 + 8 = 26.
# Яка сума цифр числа 2**1000?
def summm():
    return sum(map(int, str(2**1000)))


# D. Сума цифр в числі 100!
# n! означає n * (n-1) * ... * 3 * 2 * 1
# Знайдіть суму цифр в числі 100!
def factorial():
    return sum(map(int, str(math.factorial(100))))

def factorial_reduce():
    return sum(map(int, str(reduce(lambda x, y: x * y, range(1, 101)))))

# Проста функція test() використовується в main() для виведення
# порівняння того, що повертається з функції з тим, що вона повинна повертати.

def test(got, expected):
    if got == expected:
        prefix = ' OK '
    else:
        prefix = '  X '
    print('%s Отримано: %s | Очікувалося: %s' % (prefix, repr(got), repr(expected)))



# Викликає фунції вище з тестовими параметрами.
def main():
    print('A. Різниця між сумою квадратів і квадратом суми?')
    test(diff(), 25164150)

    print()
    print("B. Найбільший добуток п’яти послідовних цифр")
    test(max_five(), 40824)

    print()
    print('C. Сума цифр числа 2**1000')
    test(summm(), 1366)

    print()
    print('D. Сума цифр в числі 100!')
    test(factorial(), 648)

if __name__ == '__main__':
    main()
